import time

reputation = {'хвала', 'шана', 'дяка', 'аве', 'уу', 'хвала!', 'шана!', 'дяка!', 'аве!', 'уу!', 'хвала.', 'шана.',
              'дяка.', 'аве.', 'уу.'}
bad_reputation = {'зневага', 'ганьба', 'зневага!', 'ганьба!', 'зневага.', 'ганьба.'}

queue = [0, 0, 0]
t_queue = time.time()
aktyv = {}
lakt = 0
zhandarm = 0
voting_q = set()
welcome_m = {}
del_pass = 0
queue_call = [0, 0, 0]
t_queue_call = time.time()
business_seans = {}
thrash = -1001453786861
alphabet = "йцукенгшщзхїфівапролджєячсмитьбюґ-()'` "
mes = ''
stop_text = 'Якщо ви не бажаєте здійснювати цю дію, введіть <code>СТОП</code>.'
false_day = 0

zhan_queue = {}

weekdays = {
    'понеділок': (0, 'понеділок', 'Понеділкова'),
    'вівторок': (1, 'вівторок', 'Вівторкова'),
    'середа': (2, 'середу', 'Середова'),
    'четвер': (3, 'четвер', 'Четвергова'),
    "п'ятниця": (4, "п'ятницю", "П'ятнична"),
    'субота': (5, 'суботу', 'Суботня'),
    'неділя': (6, 'неділю', 'Недільна')
}

zhan_rank = {
    'Новобранець': ('НБ', 0, ('Молодший Жандарм', 'Старший Жандарм'), ('up_zh1', 'up_zh2'), 3, 'Новобранцем',
                    'Новобранця'),
    'Молодший Жандарм': ('МЖ', 1, ('Новобранець', 'Старший Жандарм'), ('down_zh0', 'up_zh2'), 5, 'Молодшим Жандармом',
                         'Молодшого Жандарма'),
    'Старший Жандарм': ('СЖ', 2, ('Новобранець', 'Молодший Жандарм'), ('down_zh0', 'down_zh1'), 7, 'Старшим Жандармом',
                        'Старшого Жандарма'),
    'Протектор': (None, None, None, None, 9, 'Протектором', 'Протектора')
}

inst_shorts = {
    'zh': 'Жандармерія',
    'gr': 'Графство',
    'bank': 'Державний Банк',
    'Жандармерії': 'Жандармерія',
    'Графства': 'Графство',
    'Державного Банку': 'Державний Банк',
}

month_num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

months = {
    1: ('січня', 31),
    2: ('лютого', 28),
    3: ('березня', 31),
    4: ('квітня', 30),
    5: ('травня', 31),
    6: ('червня', 30),
    7: ('липня', 31),
    8: ('серпня', 31),
    9: ('вересня', 30),
    10: ('жовтня', 31),
    11: ('листопада', 30),
    12: ('грудня', 31),
}

pass_form = '''
Уважно заповніть форму перед надсиланням. Скопіюйте форму і вписуйте дані уже в неї, це важливо. Ім'я і прізвище можуть бути вигадані.
<a href="">Приклад заповнення форми</a>

(натисніть на форму, і вона скопіюється)
<code>Форма для оформлення громадянства
Ім'я: 
Прізвище: 
Ім'я у знахідному відмінку: 
Прізвище у знахідному відмінку: 
Стать: Чоловіча/Жіноча
</code>
'''

business_form = '''
Уважно заповніть форму перед надсиланням. Скопіюйте форму і вписуйте дані уже в неї, це важливо.
Тег записуйте у форматі <code>TAG</code>. У тегу можна використовувати тільки великі латинські літери, числа та нижні підкреслювання.

Якщо ви хочете відмінити процедуру реєстрації, напишіть <code>СТОП</code>

(натисніть на форму, і вона скопіюється)
<code>Форма для власної справи
Назва: 
Тег: 
Рід діяльності: .
</code>
'''


decree_new_zhan = f'''
<a href="/link/">{chr(8205)}</a>Постанова Жандармерії №/num/
Про призначення на сан Жандарма
від /date/

Згідно зі Статею 1 Розділу 2 <a href="https://telegra.ph/Zakon-pro-ZHandarmer%D1%96yu-06-12">Закону про Жандармерію</a> Протектор Ячмінії /head_link/ призначає /new_emp_acc_link/ на сан Новобранця Жандармерії.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
/new_emp_link/
'''

decree_up_zhan = f'''
<a href="/link/">{chr(8205)}</a>Постанова Жандармерії №/num/
Про підвищення до звання /rank_g/
від /date/

Згідно зі Статею 1 Розділу 2 <a href="https://telegra.ph/Zakon-pro-ZHandarmer%D1%96yu-06-12">Закону про Жандармерію</a> Протектор Ячмінії /prot_link/ підвищує /up_zhan_acc_link/ до звання /rank_g/.
Постанова набуває чинності з моменту її публікації.

Підписи:
/prot_link/
'''

decree_down_zhan = f'''
<a href="/link/">{chr(8205)}</a>Постанова Жандармерії №/num/
Про пониження до звання /rank_g/
від /date/

Згідно зі Статею 1 Розділу 2 <a href="https://telegra.ph/Zakon-pro-ZHandarmer%D1%96yu-06-12">Закону про Жандармерію</a> Протектор Ячмінії /prot_link/ понижує /down_zhan_acc_link/ до звання /rank_g/.
Постанова набуває чинності з моменту її публікації.

Підписи:
/prot_link/
'''

decree_del_zhan = f'''
<a href="/link/">{chr(8205)}</a>Постанова Жандармерії №/num/
Про звільнення з сану Жандарма
від /date/

Згідно зі Статею 1 Розділу 2 <a href="https://telegra.ph/Zakon-pro-ZHandarmer%D1%96yu-06-12">Закону про Жандармерію</a> Протектор Ячмінії /head_link/ звільняє /del_emp_acc_link/ з сану Жандарма.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
'''


decree_new_erl = f'''
<a href="/link/">{chr(8205)}</a>Постанова Графства №/num/
Про призначення на сан Віконта
від /date/

Згідно зі Статею 1 Розділу "Повноваження Графства" <a href="https://telegra.ph/Zakon-pro-Grafstvo-01-28">Закону про Графство</a> Граф Ячмінії /head_link/ призначає /new_emp_acc_link/ на сан Віконта.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
/new_emp_link/
'''

decree_del_erl= f'''
<a href="/link/">{chr(8205)}</a>Постанова Графства №/num/
Про звільнення з сану Ерла
від /date/

Згідно зі Статею 1 Розділу "Повноваження Графства" <a href="https://telegra.ph/Zakon-pro-Grafstvo-01-28">Закону про Графство</a> Граф Ячмінії /head_link/ звільняє /del_emp_acc_link/ з сану Ерла.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
'''

decree_new_karb = f'''
<a href="/link/">{chr(8205)}</a>Постанова Державного Банку №/num/
Про призначення на сан Карба
від /date/

Згідно зі Статею 3 Розділу 1 <a href="https://telegra.ph/F%D1%96nansovij-zv%D1%96d-04-24">Фінансового зводу</a> Скарбник Ячмінії /head_link/ призначає /new_emp_acc_link/ на сан Карба.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
/new_emp_link/
'''

decree_del_karb = f'''
<a href="/link/">{chr(8205)}</a>Постанова Графства №/num/
Про звільнення з сану Ерла
від /date/

Згідно зі Статею 3 Розділу 1 <a href="https://telegra.ph/F%D1%96nansovij-zv%D1%96d-04-24">Фінансового зводу</a> Граф Ячмінії /head_link/ звільняє /del_emp_acc_link/ з сану Карба.
Постанова набуває чинності з моменту її публікації.

Підписи:
/head_link/
'''